from src.services import filter_by_state


def test_filter_by_state() -> None:
    operation = [
        {
            "Дата операции": "28.06.2024 13:30:39",
            "Дата платежа": "28.06.2024",
            "Номер карты": "*1781",
            "Статус": "OK",
            "Сумма операции": -160.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -160.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 1,
            "Категория": "Фастфуд",
            "MCC": "5814",
            "Описание": "Wilco Food",
            "Бонусы (включая кэшбэк)": 1.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 160.0,
        },
        {
            "Дата операции": "30.06.2024 17:09:36",
            "Дата платежа": "30.06.2024",
            "Номер карты": "*1781",
            "Статус": "OK",
            "Сумма операции": 309.97,
            "Валюта операции": "RUB",
            "Сумма платежа": 309.97,
            "Валюта платежа": "RUB",
            "Кэшбэк": 15,
            "Категория": "Супермаркет",
            "MCC": "5411",
            "Описание": "Пятёрочка",
            "Бонусы (включая кэшбэк)": 15.00,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 309.97,
        },
    ]
    assert filter_by_state(operation) == ["Wilco Food", "Пятёрочка"]
